HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalCoupledMultiRegionHeater/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

#-- Run on single processor
#runApplication $(getApplication) &
# Simulated external solver
#runApplication ./externalSolver

# Decompose
runApplication decomposePar -allRegions

## Can verify parallel operation of createExternalCoupledPatchGeometry
# \rm -f log.createExternalCoupledPatchGeometry
# runParallel createExternalCoupledPatchGeometry \
#     -regions '(topAir heater)' coupleGroup \
#     -commsDir $PWD/comms

# Run OpenFOAM
runParallel $(getApplication) &

# Simulated external solver
runApplication ./externalSolver

# Reconstruct
runApplication reconstructPar -allRegions

# -----------------------------------------------------------------------------
