HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalCoupledMultiRegionHeater/system/README
fvSolution is used for outer correctors specification.
fvSchemes is only so that pre-processing activities can proceed

